frain1219/ZHIYUN_F100/SDK/APM32F10x_SDK_V2.0.0/Utilities/SVD/APM32F103xE.svd
                <register>
                    <name>RIS</name>
                    <displayName>RIS</displayName>
                    <description>Raw interrupt status register</description>
                    <addressOffset>0x34</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <fields>
                        <field>
                            <name>RFUIF</name>
                            <description>RFUIF</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RFOIF</name>
                            <description>RFOIF</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RFFIF</name>
                            <description>RFFIF</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TFOIF</name>
                            <description>TFOIF</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TFEIF</name>
                            <description>TFEIF</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RRIF</name>
                            <description>RRIF</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TAIF</name>
                            <description>TAIF</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RDIF</name>
                            <description>RDIF</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ACTIF</name>
                            <description>ACTIF</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>STPDIF</name>
                            <description>STPDIF</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>STADIF</name>
                            <description>STADIF</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GCIF</name>
                            <description>GCIF</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RSTADIF</name>
                            <description>RSTADIF</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>MOHIF</name>
                            <description>MOHIF</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RFT</name>
                    <displayName>RFT</displayName>
                    <description>Reception FIFO threshold register </description>
                    <addressOffset>0x38</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <fields>
                        <field>
                            <name>DUALEN</name>
                            <description>Dual addressing mode enable</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ADD2</name>
                            <description>Interface address</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>7</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TFT</name>
                    <displayName>TFT</displayName>
                    <description>Transmission FIFO threshold register </description>
                    <addressOffset>0x3C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <fields>
                        <field>
                            <name>RFT</name>
                            <description>RFT</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>INTCLR</name>
                    <displayName>INTCLR</displayName>
                    <description>Interruption clear register</description>
                    <addressOffset>0x40</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <fields>
                        <field>
                            <name>TFT</name>
                            <description>TFT</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RFUIC</name>
                    <displayName>RFUIC</displayName>
                    <description>Reception FIFO underflow interruption clear register</description>
                    <addressOffset>0x44</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x0000</resetValue>
                    <fields>
                        <field>
                            <name>INTCLR</name>
                            <description>INTCLR</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RFOIC</name>
                    <displayName>RFOIC</displayName>
                    <description>Reception FIFO overflow interruption clear register</description>
                    <addressOffset>0x48</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x0000</resetValue>
                    <fields>
                        <field>
                            <name>RFUIC</name>
                            <description>RFUIC</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TFOIC</name>
                    <displayName>TFOIC</displayName>
                    <description>Transmission FIFO overflow interruption clear register</description>
                    <addressOffset>0x4C</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x0000</resetValue>
                    <fields>
                        <field>
                            <name>RFOIC</name>
                            <description>RFOIC</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RRIC</name>
                    <displayName>RRIC</displayName>
                    <description>Reception request interruption clear register</description>
                    <addressOffset>0x50</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x0000</resetValue>
                    <fields>
                        <field>
                            <name>TFOIC</name>
                            <description>TFOIC</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TAIC</name>
                    <displayName>TAIC</displayName>
                    <description>Transmission abort interruption clear register</description>
                    <addressOffset>0x54</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x0000</resetValue>
                    <fields>
                        <field>
                            <name>RRIC</name>
                            <description>RRIC</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RDIC</name>
                    <displayName>RDIC</displayName>
                    <description>Receive done interruption clear register</description>
                    <addressOffset>0x58</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x0000</resetValue>
                    <fields>
                        <field>
                            <name>RDIC</name>
                            <description>RDIC</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>AIC</name>
                    <displayName>AIC</displayName>
                    <description>Activity interruption clear register</description>
                    <addressOffset>0x5C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <fields>
                        <field>
                            <name>AIC</name>
                            <description>AIC</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>STPDIC</name>
                    <displayName>STPDIC</displayName>
                    <description>Stop detection interruption clear register</description>
                    <addressOffset>0x60</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <fields>
                        <field>
                            <name>STPDIC</name>
                            <description>STPDIC</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>STADIC</name>
                    <displayName>STADIC</displayName>
                    <description>Start detection interruption clear register</description>
                    <addressOffset>0x64</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <fields>
                        <field>
                            <name>STADIC</name>
                            <description>STADIC</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GCIC</name>
                    <displayName>GCIC</displayName>
                    <description>General call interruption clear register</description>
                    <addressOffset>0x68</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <fields>
                        <field>
                            <name>GCIC</name>
                            <description>GCIC</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTRL2</name>
                    <displayName>CTRL2</displayName>
                    <description>Control register 2</description>
                    <addressOffset>0x6C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <fields>
                        <field>
                            <name>I2CEN</name>
                            <description>I2CEN</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ABR</name>
                            <description>ABR</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TCB</name>
                            <description>TCB</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>STS1</name>
                    <displayName>STS1</displayName>
                    <description>Status register 1</description>
                    <addressOffset>0x70</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x0006</resetValue>
                    <fields>
                        <field>
                            <name>ACTF</name>
                            <description>ACTF</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TFNFF</name>
                            <description>TFNFF</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TFEF</name>
                            <description>TFEF</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RFNEF</name>
                            <description>RFNEF</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RFFF</name>
                            <description>RFFF</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>MAF</name>
                            <description>MAF</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SAF</name>
                            <description>SAF</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TFL</name>
                    <displayName>TFL</displayName>
                    <description>Transmission FIFO level</description>
                    <addressOffset>0x74</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <fields>
                        <field>
                            <name>TFL</name>
                            <description>TFL</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RFL</name>
                    <displayName>RFL</displayName>
                    <description>Reception FIFO level</description>
                    <addressOffset>0x78</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <fields>
                        <field>
                            <name>RFL</name>
                            <description>RFL</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SDAHOLD</name>
                    <displayName>SDAHOLD</displayName>
                    <description>SDA hold time length register</description>
                    <addressOffset>0x7C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x0001</resetValue>
                    <fields>
                        <field>
                            <name>TXHOLD</name>
                            <description>TXHOLD</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                        <field>
                            <name>RXHOLD</name>
                            <description>RXHOLD</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
