frain1219/ZHIYUN_F100/SDK/APM32F10x_SDK_V2.0.0/Utilities/SVD/APM32F103xE.svd
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>WRTTIM1</name>
                    <displayName>WRTTIM1</displayName>
                    <description>SRAM/NOR-Flash write timing registers 1</description>
                    <addressOffset>0x104</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x0FFFFFFF</resetValue>
                    <fields>
                        <field>
                            <name>ASYNCACCCFG</name>
                            <description>ASYNCACCCFG</description>
                            <bitOffset>28</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>DATALATCFG</name>
                            <description>DATALATCFG</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>CLKDIVCFG</name>
                            <description>CLKDIVCFG</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>BUSTURNCFG</name>
                            <description>BUSTURNCFG</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>DATASETCFG</name>
                            <description>DATASETCFG</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>ADDRHLDCFG</name>
                            <description>ADDRHLDCFG</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>ADDRSETCFG</name>
                            <description>ADDRSETCFG</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>WRTTIM2</name>
                    <displayName>WRTTIM2</displayName>

                    <description>SRAM/NOR-Flash write timing registers 2</description>
                    <addressOffset>0x10C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x0FFFFFFF</resetValue>
                    <fields>
                        <field>
                            <name>ASYNCACCCFG</name>
                            <description>ASYNCACCCFG</description>

                            <bitOffset>28</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>DATALATCFG</name>
                            <description>DATALATCFG</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>CLKDIVCFG</name>
                            <description>CLKDIVCFG</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>BUSTURNCFG</name>
                            <description>BUSTURNCFG</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>DATASETCFG</name>
                            <description>DATASETCFG</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>ADDRHLDCFG</name>
                            <description>ADDRHLDCFG</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>ADDRSETCFG</name>
                            <description>ADDRSETCFG</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                    </fields>

                </register>
                <register>
                    <name>WRTTIM3</name>
                    <displayName>WRTTIM3</displayName>

                    <description>SRAM/NOR-Flash write timing registers 3</description>
                    <addressOffset>0x114</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x0FFFFFFF</resetValue>
                    <fields>
                        <field>
                            <name>ASYNCACCCFG</name>
                            <description>ASYNCACCCFG</description>

                            <bitOffset>28</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>DATALATCFG</name>
                            <description>DATALATCFG</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>CLKDIVCFG</name>
                            <description>CLKDIVCFG</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>BUSTURNCFG</name>
                            <description>BUSTURNCFG</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>DATASETCFG</name>
                            <description>DATASETCFG</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>ADDRHLDCFG</name>
                            <description>ADDRHLDCFG</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>ADDRSETCFG</name>
                            <description>ADDRSETCFG</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                    </fields>

                </register>
                <register>
                    <name>WRTTIM4</name>
                    <displayName>WRTTIM4</displayName>

